Tekla Open API Reference for Tekla Structures 2025
InvalidPluginPickerInputException Class
 The InvalidPluginPickerInputException class defines the exception that is thrown when UI.Picker is used during a Plugin.Insert call but the previously assigned PluginPickerInput does not correspond to the next UI.Picker call.
Inheritance Hierarchy
System.Object
 System.Exception
 System.ApplicationException
 Tekla.Structures.Drawing.TeklaStructuresDrawingsApplicationException
 Tekla.Structures.Drawing.InvalidPluginPickerInputException
 Namespace: Tekla.Structures.Drawing
 Assembly: Tekla.Structures.Drawing (in Tekla.Structures.Drawing.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
[SerializableAttribute]
public class InvalidPluginPickerInputException : TeklaStructuresDrawingsApplicationException
<SerializableAttribute>
Public Class InvalidPluginPickerInputException
	Inherits TeklaStructuresDrawingsApplicationException
The InvalidPluginPickerInputException type exposes the following members.
Constructors
Name | Description
InvalidPluginPickerInputException
 Creates a new InvalidPluginPickerInputException instance.
Top
See Also
Reference
Tekla.Structures.Drawing Namespace